#### AnalysisDisplayStyleVectorPosition Enumeration

---

|  |
| --- |
| See Also |

Defines vector position for vector settings of analysis display style.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public enum AnalysisDisplayStyleVectorPosition ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalysisDisplayStyleVectorPosition ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalysisDisplayStyleVectorPosition ``` |

# Members

| Member name | Description |
| --- | --- |
| ToDataPoint |  |
| FromDataPoint |  |

# See Also

Autodesk.Revit.DB.Analysis Namespace